ItaySharon/cmsis-svd/data/NXP/LPC13Uxx_v1.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x28</addressOffset>
        <description>Capture Control Register. The CCR controls which edges of the capture inputs are used to load the Capture Registers and whether or not an interrupt is generated when a capture takes place.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Capture on CT32B0_CAP0 rising edge: a sequence of 0 then 1 on CT32B0_CAP0 will cause CR0 to be loaded with the contents of TC.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enabled.</description>
                <name>ENABLED_</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disabled.</description>
                <name>DISABLED_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CAP0RE</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Capture on CT32B0_CAP0 falling edge: a sequence of 1 then 0 on CT32B0_CAP0 will cause CR0 to be loaded with the contents of TC.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enabled.</description>
                <name>ENABLED_</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disabled.</description>
                <name>DISABLED_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CAP0FE</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt on CT32B0_CAP0 event: a CR0 load due to a CT32B0_CAP0 event will generate an interrupt.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enabled.</description>
                <name>ENABLED_</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disabled.</description>
                <name>DISABLED_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CAP0I</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Capture on CT32B0_CAP1 rising edge: a sequence of 0 then 1 on CT32B0_CAP1 will cause CR1 to be loaded with the contents of TC.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enabled.</description>
                <name>ENABLED_</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disabled.</description>
                <name>DISABLED_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CAP1RE</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Capture on CT32B0_CAP1 falling edge: a sequence of 1 then 0 on CT32B0_CAP1 will cause CR1 to be loaded with the contents of TC.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enabled.</description>
                <name>ENABLED_</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disabled.</description>
                <name>DISABLED_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CAP1FE</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt on CT32B0_CAP1 event: a CR1 load due to a CT32B0_CAP1 event will generate an interrupt.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enabled.</description>
                <name>ENABLED_</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disabled.</description>
                <name>DISABLED_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CAP1I</name>
          </field>
        </fields>
        <name>CCR</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x2C</addressOffset>
        <description>Capture Register 0. CR0 is loaded with the value of TC when there is an event on the CT32B0_CAP0 input.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x20</bitWidth>
            <description>Timer counter capture value.</description>
            <name>CAP</name>
          </field>
        </fields>
        <name>CR0</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
