ItaySharon/cmsis-svd/data/NXP/LPC13Uxx_v1.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x4</addressOffset>
        <description>Interrupt Enable Register. Contains individual interrupt enable bits for the 7 potential USART interrupts. (DLAB=0)</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>RBR Interrupt Enable. Enables the Receive Data Available interrupt. It also controls the Character Receive Time-out interrupt.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable the RDA interrupt.</description>
                <name>DISABLE_THE_RDA_INTE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable the RDA interrupt.</description>
                <name>ENABLE_THE_RDA_INTER</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>RBRINTEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>THRE Interrupt Enable. Enables the THRE interrupt. The status of this interrupt can be read from LSR[5].</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable the THRE interrupt.</description>
                <name>DISABLE_THE_THRE_INT</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable the THRE interrupt.</description>
                <name>ENABLE_THE_THRE_INTE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>THREINTEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Enables the Receive Line Status interrupt. The status of this interrupt can be read from LSR[4:1].</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable the RLS interrupt.</description>
                <name>DISABLE_THE_RLS_INTE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable the RLS interrupt.</description>
                <name>ENABLE_THE_RLS_INTER</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>RLSINTEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Enables the Modem Status interrupt. The components of this interrupt can be read from the MSR.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable the MS interrupt.</description>
                <name>DISABLE_THE_MS_INTER</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable the MS interrupt.</description>
                <name>ENABLE_THE_MS_INTERR</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MSINTEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Enables the end of auto-baud interrupt.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable end of auto-baud Interrupt.</description>
                <name>DISABLE_END_OF_AUTO_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable end of auto-baud Interrupt.</description>
                <name>ENABLE_END_OF_AUTO_B</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>ABEOINTEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x9</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Enables the auto-baud time-out interrupt.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable auto-baud time-out Interrupt.</description>
                <name>DISABLE_AUTO_BAUD_TI</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable auto-baud time-out Interrupt.</description>
                <name>ENABLE_AUTO_BAUD_TIM</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>ABTOINTEN</name>
          </field>
        </fields>
        <name>IER</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x8</addressOffset>
        <description>Interrupt ID Register. Identifies which interrupt(s) are pending.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt status. Note that IIR[0] is active low. The pending interrupt can be determined by evaluating IIR[3:1].</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>At least one interrupt is pending.</description>
                <name>AT_LEAST_ONE_INTERRU</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>No interrupt is pending.</description>
                <name>NO_INTERRUPT_IS_PEND</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>INTSTATUS</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Interrupt identification. IER[3:1] identifies an interrupt corresponding to the USART Rx FIFO. All other values of IER[3:1] not listed below are reserved.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>1   - Receive Line Status (RLS).</description>
                <name>1_RECEIVE_LINE_S</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>2a - Receive Data Available (RDA).</description>
                <name>2A__RECEIVE_DATA_AV</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>2b - Character Time-out Indicator (CTI).</description>
                <name>2B__CHARACTER_TIME_</name>
                <value>0x6</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>3   - THRE Interrupt.</description>
                <name>3_THRE_INTERRUPT</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>4   - Modem status</description>
                <name>4_MODEM_STATUS</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>INTID</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>These bits are equivalent to FCR[0].</description>
            <name>FIFOEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>End of auto-baud interrupt. True if auto-baud has finished successfully and interrupt is enabled.</description>
            <name>ABEOINT</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x9</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Auto-baud time-out interrupt. True if auto-baud has timed out and interrupt is enabled.</description>
            <name>ABTOINT</name>
          </field>
        </fields>
        <name>IIR</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x1</resetValue>
        <size>0x20</size>
      </register>
