ItaySharon/cmsis-svd/data/NXP/LPC13Uxx_v1.svd
    </registers>
    <registers>
      <register>
        <access>write-only</access>
        <addressOffset>0x8</addressOffset>
        <description>FIFO Control Register. Controls USART FIFO usage and modes.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>FIFO enable</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>USART FIFOs are disabled. Must not be used in the application.</description>
                <name>DISABLED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Active high enable for both USART Rx and TX FIFOs and FCR[7:1] access. This bit must be set for proper USART operation. Any transition on this bit will automatically clear the USART FIFOs.</description>
                <name>ENABLED</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>FIFOEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>RX FIFO Reset</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No impact on either of USART FIFOs.</description>
                <name>NO_IMPACT</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Writing a logic 1 to FCR[1] will clear all bytes in USART Rx FIFO, reset the pointer logic. This bit is self-clearing.</description>
                <name>CLEAR</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>RXFIFORES</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>TX FIFO Reset</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No impact on either of USART FIFOs.</description>
                <name>NO_IMPACT</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Writing a logic 1 to FCR[2] will clear all bytes in USART TX FIFO, reset the pointer logic. This bit is self-clearing.</description>
                <name>CLEAR</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>TXFIFORES</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>RX Trigger Level. These two bits determine how many receiver USART FIFO characters must be written before an interrupt is activated.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Trigger level 0 (1 character or 0x01).</description>
                <name>TRIGGER_LEVEL_0_1_C</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Trigger level 1 (4 characters or 0x04).</description>
                <name>TRIGGER_LEVEL_1_4_C</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Trigger level 2 (8 characters or 0x08).</description>
                <name>TRIGGER_LEVEL_2_8_C</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Trigger level 3 (14 characters or 0x0E).</description>
                <name>TRIGGER_LEVEL_3_14_</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>RXTL</name>
          </field>
        </fields>
        <name>FCR</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xC</addressOffset>
        <description>Line Control Register. Contains controls for frame formatting and break generation.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Word Length Select</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>5-bit character length.</description>
                <name>5_BIT_CHARACTER_LENG</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>6-bit character length.</description>
                <name>6_BIT_CHARACTER_LENG</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>7-bit character length.</description>
                <name>7_BIT_CHARACTER_LENG</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>8-bit character length.</description>
                <name>8_BIT_CHARACTER_LENG</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>WLS</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Stop Bit Select</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>1 stop bit.</description>
                <name>1_STOP_BIT_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>2 stop bits (1.5 if LCR[1:0]=00).</description>
                <name>2_STOP_BITS_1_5_IF_</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SBS</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Parity Enable</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable parity generation and checking.</description>
                <name>DISABLE_PARITY_GENER</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable parity generation and checking.</description>
                <name>ENABLE_PARITY_GENERA</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>PE</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Parity Select</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Odd parity. Number of 1s in the transmitted character and the attached parity bit will be odd.</description>
                <name>ODD_PARITY_NUMBER_O</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Even Parity. Number of 1s in the transmitted character and the attached parity bit will be even.</description>
                <name>EVEN_PARITY_NUMBER_</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Forced 1 stick parity.</description>
                <name>FORCED_1_STICK_PARIT</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Forced 0 stick parity.</description>
                <name>FORCED_0_STICK_PARIT</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>PS</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Break Control</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable break transmission.</description>
                <name>DISABLE_BREAK_TRANSM</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable break transmission. Output pin USART TXD is forced to logic 0 when LCR[6] is active high.</description>
                <name>ENABLE_BREAK_TRANSMI</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>BC</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Divisor Latch Access Bit</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable access to Divisor Latches.</description>
                <name>DISABLE_ACCESS_TO_DI</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable access to Divisor Latches.</description>
                <name>ENABLE_ACCESS_TO_DIV</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>DLAB</name>
          </field>
        </fields>
        <name>LCR</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
