ItaySharon/cmsis-svd/data/NXP/LPC13Uxx_v1.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x24</addressOffset>
        <description>IrDA Control Register. Enables and configures the IrDA (remote control) mode.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>IrDA mode enable</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>IrDA mode is disabled, USARTn acts as a standard USART.</description>
                <name>IRDA_MODE_IS_DISABLE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>IrDA mode is enabled.</description>
                <name>IRDA_MODE_IS_ENABLED</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>IRDAEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Serial input inverter</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>The serial input is not inverted.</description>
                <name>INVERTED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>The serial input is inverted. This has no effect on the serial output.</description>
                <name>NOT_INVERTED</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>IRDAINV</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>IrDA fixed pulse width mode.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>IrDA fixed pulse width mode disabled.</description>
                <name>DISABLED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>IrDA fixed pulse width mode enabled.</description>
                <name>ENABLED</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>FIXPULSEEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Configures the pulse width when FixPulseEn = 1.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>3 / (16 x baud rate)</description>
                <name>3_DIV_16_X_BAUD_RATE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>2 x TPCLK</description>
                <name>2_X_TPCLK</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>4 x TPCLK</description>
                <name>4_X_TPCLK</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>8 x TPCLK</description>
                <name>8_X_TPCLK</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>16 x TPCLK</description>
                <name>16_X_TPCLK</name>
                <value>0x4</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>32 x TPCLK</description>
                <name>32_X_TPCLK</name>
                <value>0x5</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>64 x TPCLK</description>
                <name>64_X_TPCLK</name>
                <value>0x6</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>128 x TPCLK</description>
                <name>128_X_TPCLK</name>
                <value>0x7</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>PULSEDIV</name>
          </field>
        </fields>
        <name>ICR</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x28</addressOffset>
        <description>Fractional Divider Register. Generates a clock input for the baud rate divider.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>Baud rate generation pre-scaler divisor value. If this field is 0, fractional baud rate generator will not impact the USART baud rate.</description>
            <name>DIVADDVAL</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>Baud rate pre-scaler multiplier value. This field must be greater or equal 1 for USART to operate properly, regardless of whether the fractional baud rate generator is used or not.</description>
            <name>MULVAL</name>
          </field>
        </fields>
        <name>FDR</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x10</resetValue>
        <size>0x20</size>
      </register>
