ItaySharon/cmsis-svd/data/NXP/LPC13Uxx_v1.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x54</addressOffset>
        <description>RS-485/EIA-485 direction control delay.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Contains the direction control (RTS or DTR) delay value. This register works in conjunction with an 8-bit counter.</description>
            <name>DLY</name>
          </field>
        </fields>
        <name>RS485DLY</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x58</addressOffset>
        <description>Synchronous mode control register.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Enables synchronous mode.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disabled</description>
                <name>DISABLED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enabled</description>
                <name>ENABLED</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SYNC</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clock source select.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Synchronous slave mode (SCLK in)</description>
                <name>SYNCHRONOUS_SLAVE_MO</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Synchronous master mode (SCLK out)</description>
                <name>SYNCHRONOUS_MASTER_M</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CSRC</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Falling edge sampling.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>RxD is sampled on the rising edge of SCLK </description>
                <name>RISING</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>RxD is sampled on the falling edge of SCLK</description>
                <name>FALLING</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>FES</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmit synchronization bypass in synchronous slave mode.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>The input clock is synchronized prior to being used in clock edge detection logic</description>
                <name>SYNC</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>The input clock is not synchronized prior to being used in clock edge detection logic. This allows for a high er input clock rate at the expense of potential metastability.</description>
                <name>NOSYNC</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>TSBYPASS</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Continuous master clock enable (used only when CSRC is 1)</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>SCLK cycles only when characters are being sent on TxD</description>
                <name>SCLK_CYCLES_ONLY_WHE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>SCLK runs continuously (characters can be received on RxD independently from transmission on TxD)</description>
                <name>SCLK_RUNS_CONTINUOUS</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CSCEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Start/stop bits</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Send start and stop bits as in other modes.</description>
                <name>SEND_START_STOP</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Do not send start/stop bits.</description>
                <name>NOT_SEND_START_STOP</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SSDIS</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Continuous clock clear</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>CSCEN is under software control.</description>
                <name>CSCEN_IS_UNDER_SOFTW</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Hardware clears CSCEN after each character is received.</description>
                <name>HARDWARE_CLEARS_CSCE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CCCLR</name>
          </field>
        </fields>
        <name>SYNCCTRL</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
