ItaySharon/cmsis-svd/data/NXP/LPC13Uxx_v1.svd
    </registers>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <addressBlock>
      <offset>0x0</offset>
      <size>0xFFF</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x4001C000</baseAddress>
    <description>ADC</description>
    <groupName>ADC</groupName>
    <interrupts>
      <interrupt>
        <name>ADC</name>
        <value>0x18</value>
      </interrupt>
    </interrupts>
    <name>ADC</name>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x0</addressOffset>
        <description>A/D Control Register. The CR register must be written to select the operating mode before A/D conversion can occur.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Selects which of the AD7:0 pins is (are) to be sampled and converted. Bit 0 selects Pin AD0, bit 1 selects pin AD1,..., and bit 7 selects pin AD7.  In software-controlled mode (BURST = 0), only one channel can be selected, i.e. only one of these bits should be 1.  In hardware scan mode (BURST = 1), any numbers of channels can be selected, i.e any or all bits can be set to 1. If all bits are set to 0, channel 0 is selected automatically (SEL = 0x01).</description>
            <name>SEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>The main clock (PCLK_ADC) is divided by (this value plus one) to produce the clock for  the A/D converter. The clock should be less than or equal to 15.5 MHz(12-bit mode) or 31 MHz (10-bit mode) in software-controlled mode (BURST bit = 0).. Typically, software should program the smallest value in this field that yields a clock of 15.5 MHz or slightly less, but in certain cases (such as a high-impedance analog  source) a slower clock may be desirable.</description>
            <name>CLKDIV</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x10</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Burst mode If BURST is set to 1, the ADGINTEN bit in the INTEN register (Table 327) must be set to 0.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Software-controlled mode: Conversions are software-controlled and require 31 clocks.</description>
                <name>SOFTWARE_CONTROLLED_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Hardware scan mode: The AD converter does repeated conversions at the rate selected by the CLKS field, scanning (if necessary) through the pins selected by ones in the SEL field. The first conversion after the start corresponds to the least-significant bit set to 1 in the SEL field, then the next higher  bits (pins) set to one are scanned if applicable. Repeated conversions can be terminated by clearing this bit, but the conversion in progress when this bit is cleared will be completed. Important: START bits must be 000 when BURST = 1, or conversions will not start.</description>
                <name>HARDWARE_SCAN_MODE_</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>BURST</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x16</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Low-power mode</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable the low-power ADC mode. The analog circuitry remains activated when no conversions are requested.</description>
                <name>DISABLE_THE_LOW_POWE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable the low-power ADC mode.  The analog circuitry is automatically powered-down when no conversions are taking  place. When any (hardware or software) triggering event is detected, the analog circuitry  is enabled. After the required start-up time, the requested conversion will be launched.  Once the conversion completes, the analog-circuitry will again be powered-down provided  no further conversions are pending.  This mode will NOT power-up the A/D if the ADC is powered down (ADC_PD bit in the PDRUNCFG register is HIGH) or if the part is in Deep-sleep, Power-down, or Deep power-down mode.</description>
                <name>ENABLE_THE_LOW_POWER</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>LPWRMODE</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x17</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>10-bit conversion rate mode</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable the 10-bit conversion rate mode.</description>
                <name>DISABLE_THE_10_BIT_C</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable the 10-bit conversion rate mode with high conversion rate.The A/D resolution is reduced to 10 bits (the two LSB of the conversion result will be forced  to 0). The clock rate (set via the CLKDIV field) can be doubled to up to 31 MHz to  achieve a conversion rate of up to one million samples per second.</description>
                <name>ENABLE_THE_10_BIT_CO</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MODE10BIT</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x18</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>When the BURST bit is 0, these bits control whether and when an A/D conversion is started:</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No start (this value should be used when clearing PDN to 0).</description>
                <name>NO_START_THIS_VALUE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Start conversion now.</description>
                <name>START_CONVERSION_NOW</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Start conversion when the edge selected by bit 27 occurs on PIO0_2/SSEL/CT16B0_CAP0.</description>
                <name>PIO0_2</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Start conversion when the edge selected by bit 27 occurs on PIO1_5/DIR/CT32B0_CAP0.</description>
                <name>PIO1_5</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Start conversion when the edge selected by bit 27 occurs on CT32B0_MAT0[1].</description>
                <name>CT32B0_MAT0</name>
                <value>0x4</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Start conversion when the edge selected by bit 27 occurs on CT32B0_MAT1[1].</description>
                <name>CT32B0_MAT1</name>
                <value>0x5</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Start conversion when the edge selected by bit 27 occurs on CT16B0_MAT0[1].</description>
                <name>CT16B0_MAT0</name>
                <value>0x6</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Start conversion when the edge selected by bit 27 occurs on CT16B0_MAT1[1].</description>
                <name>CT16B0_MAT1</name>
                <value>0x7</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>START</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1B</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Edge control. This bit is significant only when the START field contains 010-111.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Start conversion on a rising edge on the selected CAP/MAT signal.</description>
                <name>RISING</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Start conversion on a falling edge on the selected CAP/MAT signal.</description>
                <name>FALLING</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>EDGE</name>
          </field>
        </fields>
        <name>CR</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
