ItaySharon/cmsis-svd/data/NXP/LPC13Uxx_v1.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x10</addressOffset>
        <description>A/D Channel N Data
        Register. This register contains the result of the most recent conversion
        completed on channel n</description>
        <displayName>DR[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0xC</bitWidth>
            <description>When DONE is 1, this field contains a binary fraction representing the voltage on the ADn pin as it falls within the range of VREFP to VREFN. Zero in the field indicates that the voltage on the ADn pin was less than, equal to, or close to that on VREFN/VSS, while 0xFFF indicates that the voltage on AD input was close to, equal to, or greater than that on VREFP/VDD.</description>
            <name>V_VREF</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1E</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>This bit is 1 in burst mode if the results of one or more conversions was (were) lost and overwritten before the conversion that produced the result in the V_VREF bits.This bit is cleared by reading this register.</description>
            <name>OVERRUN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1F</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>This bit is set to 1 when an A/D conversion completes. It is cleared when this register is read.</description>
            <name>DONE</name>
          </field>
        </fields>
        <name>DR[0]</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x100</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x14</addressOffset>
        <description>A/D Channel N Data
        Register. This register contains the result of the most recent conversion
        completed on channel n</description>
        <displayName>DR[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0xC</bitWidth>
            <description>When DONE is 1, this field contains a binary fraction representing the voltage on the ADn pin as it falls within the range of VREFP to VREFN. Zero in the field indicates that the voltage on the ADn pin was less than, equal to, or close to that on VREFN/VSS, while 0xFFF indicates that the voltage on AD input was close to, equal to, or greater than that on VREFP/VDD.</description>
            <name>V_VREF</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1E</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>This bit is 1 in burst mode if the results of one or more conversions was (were) lost and overwritten before the conversion that produced the result in the V_VREF bits.This bit is cleared by reading this register.</description>
            <name>OVERRUN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1F</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>This bit is set to 1 when an A/D conversion completes. It is cleared when this register is read.</description>
            <name>DONE</name>
          </field>
        </fields>
        <name>DR[1]</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x100</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x18</addressOffset>
        <description>A/D Channel N Data
        Register. This register contains the result of the most recent conversion
        completed on channel n</description>
        <displayName>DR[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0xC</bitWidth>
            <description>When DONE is 1, this field contains a binary fraction representing the voltage on the ADn pin as it falls within the range of VREFP to VREFN. Zero in the field indicates that the voltage on the ADn pin was less than, equal to, or close to that on VREFN/VSS, while 0xFFF indicates that the voltage on AD input was close to, equal to, or greater than that on VREFP/VDD.</description>
            <name>V_VREF</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1E</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>This bit is 1 in burst mode if the results of one or more conversions was (were) lost and overwritten before the conversion that produced the result in the V_VREF bits.This bit is cleared by reading this register.</description>
            <name>OVERRUN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1F</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>This bit is set to 1 when an A/D conversion completes. It is cleared when this register is read.</description>
            <name>DONE</name>
          </field>
        </fields>
        <name>DR[2]</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x100</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x1C</addressOffset>
        <description>A/D Channel N Data
        Register. This register contains the result of the most recent conversion
        completed on channel n</description>
        <displayName>DR[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0xC</bitWidth>
            <description>When DONE is 1, this field contains a binary fraction representing the voltage on the ADn pin as it falls within the range of VREFP to VREFN. Zero in the field indicates that the voltage on the ADn pin was less than, equal to, or close to that on VREFN/VSS, while 0xFFF indicates that the voltage on AD input was close to, equal to, or greater than that on VREFP/VDD.</description>
            <name>V_VREF</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1E</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>This bit is 1 in burst mode if the results of one or more conversions was (were) lost and overwritten before the conversion that produced the result in the V_VREF bits.This bit is cleared by reading this register.</description>
            <name>OVERRUN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1F</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>This bit is set to 1 when an A/D conversion completes. It is cleared when this register is read.</description>
            <name>DONE</name>
          </field>
        </fields>
        <name>DR[3]</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x100</resetValue>
      </register>
