ItaySharon/cmsis-svd/data/NXP/LPC13Uxx_v1.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x238</addressOffset>
        <description>Power configuration register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>IRC oscillator output power-down</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered down</description>
                <name>POWERED_DOWN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered</description>
                <name>POWERED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>IRCOUT_PD</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>IRC oscillator power-down</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered down</description>
                <name>POWERED_DOWN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered</description>
                <name>POWERED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>IRC_PD</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Flash power-down</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered down</description>
                <name>POWERED_DOWN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered</description>
                <name>POWERED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>FLASH_PD</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>BOD power-down</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered down</description>
                <name>POWERED_DOWN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered</description>
                <name>POWERED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>BOD_PD</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>ADC power-down</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered down</description>
                <name>POWERED_DOWN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered</description>
                <name>POWERED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>ADC_PD</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Crystal oscillator power-down</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered down</description>
                <name>POWERED_DOWN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered</description>
                <name>POWERED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SYSOSC_PD</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Watchdog oscillator power-down</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered down</description>
                <name>POWERED_DOWN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered</description>
                <name>POWERED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>WDTOSC_PD</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>System PLL power-down</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered down</description>
                <name>POWERED_DOWN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered</description>
                <name>POWERED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SYSPLL_PD</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>USB PLL power-down</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered</description>
                <name>POWERED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Powered down</description>
                <name>POWERED_DOWN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>USBPLL_PD</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xA</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>USB transceiver power-down configuration</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>USB transceiver powered</description>
                <name>USB_TRANSCEIVER_POWE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>USB transceiver powered down (suspend mode)</description>
                <name>USB_TRANSCEIVER_POWE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>USBPAD_PD</name>
          </field>
        </fields>
        <name>PDRUNCFG</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
