ItaySharon/cmsis-svd/data/NXP/LPC13Uxx_v1.svd
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x3F8</addressOffset>
        <description>Device ID</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x20</bitWidth>
            <description>LPC1345FHN33 = 0x2801 0541 LPC1345FBD48 = 0x2801 0541 LPC1346FHN33 = 0x0801 8542 LPC1346FBD48 = 0x0801 8542 LPC1347FHN33 = 0x0802 0543 LPC1347FBD48 = 0x0802 0543 LPC1347FBD64 = 0x0802 0543 LPC1315FHN33 = 0x3A01 0523 LPC1315FBD48 = 0x3A01 0523 LPC1316FHN33 = 0x1A01 8524 LPC1316FBD48 = 0x1A01 8524 LPC1317FHN33 = 0x1A02 0525 LPC1317FBD48 = 0x1A02 0525 LPC1317FBD64 = 0x1A02 0525</description>
            <name>DEVICEID</name>
          </field>
        </fields>
        <name>DEVICE_ID</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x178</addressOffset>
        <description>GPIO Pin Interrupt Select register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x5</bitWidth>
            <description>Pin number within the port selected by the PORTSEL bit in this register.</description>
            <name>INTPIN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Select the port for the pin number to be selected in the INTPIN bits of this register.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Port 0</description>
                <name>PORT_0</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Port 1</description>
                <name>PORT_1</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>PORTSEL</name>
          </field>
        </fields>
        <name>PINTSEL0</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x17C</addressOffset>
        <description>GPIO Pin Interrupt Select register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x5</bitWidth>
            <description>Pin number within the port selected by the PORTSEL bit in this register.</description>
            <name>INTPIN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Select the port for the pin number to be selected in the INTPIN bits of this register.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Port 0</description>
                <name>PORT_0</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Port 1</description>
                <name>PORT_1</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>PORTSEL</name>
          </field>
        </fields>
        <name>PINTSEL1</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x180</addressOffset>
        <description>GPIO Pin Interrupt Select register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x5</bitWidth>
            <description>Pin number within the port selected by the PORTSEL bit in this register.</description>
            <name>INTPIN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Select the port for the pin number to be selected in the INTPIN bits of this register.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Port 0</description>
                <name>PORT_0</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Port 1</description>
                <name>PORT_1</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>PORTSEL</name>
          </field>
        </fields>
        <name>PINTSEL2</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x184</addressOffset>
        <description>GPIO Pin Interrupt Select register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x5</bitWidth>
            <description>Pin number within the port selected by the PORTSEL bit in this register.</description>
            <name>INTPIN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Select the port for the pin number to be selected in the INTPIN bits of this register.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Port 0</description>
                <name>PORT_0</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Port 1</description>
                <name>PORT_1</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>PORTSEL</name>
          </field>
        </fields>
        <name>PINTSEL3</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
      </register>
