ItaySharon/cmsis-svd/data/NXP/LPC13Uxx_v1.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xC</addressOffset>
        <description>Counter LSB register. 32 LSBs of the counter.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x20</bitWidth>
            <description>32 LSBs of the up counter. Counts continuously unless RITEN bit in CTRL register is cleared or debug mode is entered (if enabled by the RITNEBR bit in RICTRL). Can be loaded to any value in software.</description>
            <name>RICOUNTER</name>
          </field>
        </fields>
        <name>COUNTER</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x10</addressOffset>
        <description>Compare value MSB register. Holds the 16 MSBs of the compare value.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x10</bitWidth>
            <description>Compare value MSB register. Holds the 16 MSBs of the compare value which is compared to the counter.</description>
            <name>RICOMP</name>
          </field>
        </fields>
        <name>COMPVAL_H</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0xFFFF</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x14</addressOffset>
        <description>Mask MSB register. This register holds the 16 MSBs of the mask value. A one written to any bit will force a compare on the corresponding bit of the counter and compare register.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x10</bitWidth>
            <description>Mask register. This register holds the 16 MSBs of the mask value. A one written to any bit overrides the result of the comparison for the corresponding bit of the counter and compare register (causes the comparison of the register bits to be always true).</description>
            <name>RIMASK</name>
          </field>
        </fields>
        <name>MASK_H</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x18</addressOffset>
        <description>Counter MSB register. 16 MSBs of the counter.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x10</bitWidth>
            <description>16 LSBs of the up counter. Counts continuously unless RITEN bit in RICTRL register is cleared or debug mode is entered (if enabled by the RITNEBR bit in RICTRL). Can be loaded to any value in software.</description>
            <name>RICOUNTER</name>
          </field>
        </fields>
        <name>COUNTER_H</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <addressBlock>
      <offset>0x0</offset>
      <size>0xFFF</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x40080000</baseAddress>
    <description>USB2.0 device controller</description>
    <groupName>USB</groupName>
    <interrupts>
      <interrupt>
        <name>USB_IRQ</name>
        <value>0x16</value>
      </interrupt>
    </interrupts>
    <interrupts>
      <interrupt>
        <name>USB_FIQ</name>
        <value>0x17</value>
      </interrupt>
    </interrupts>
    <interrupts>
      <interrupt>
        <name>USBWAKEUP</name>
        <value>0x1E</value>
      </interrupt>
    </interrupts>
    <name>USB</name>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x0</addressOffset>
        <description>USB Device Command/Status register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x7</bitWidth>
            <description>USB device address. After bus reset, the address is reset to 0x00. If the enable bit is set, the device will respond on packets for function address DEV_ADDR. When receiving a SetAddress Control Request from the USB host, software must program the new address before completing the status phase of the SetAddress Control Request.</description>
            <name>DEV_ADDR</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>USB device enable. If this bit is set, the HW will start responding on packets for function address DEV_ADDR.</description>
            <name>DEV_EN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>SETUP token received. If a SETUP token is received and acknowledged by the device, this bit is set. As long as this bit is set all received IN and OUT tokens will be NAKed by HW. SW must clear this bit by writing a one. If this bit is zero, HW will handle the tokens to the CTRL EP0 as indicated by the CTRL EP0 IN and OUT data information programmed by SW.</description>
            <name>SETUP</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x9</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Always PLL Clock on:</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>USB_NeedClk functional</description>
                <name>USB_NEEDCLK_FUNCTION</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>USB_NeedClk always 1. Clock will not be stopped in case of suspend.</description>
                <name>USB_NEEDCLK_ALWAYS_1</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>PLL_ON</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xB</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>LPM Supported:</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>LPM not supported.</description>
                <name>LPM_NOT_SUPPORTED_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>LPM supported.</description>
                <name>LPM_SUPPORTED_</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>LPM_SUP</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xC</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt on NAK for interrupt and bulk OUT EP</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Only acknowledged packets generate an interrupt</description>
                <name>ACKNOW</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Both acknowledged and NAKed packets generate interrupts.</description>
                <name>ACKNOW_NAK</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>INTONNAK_AO</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xD</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt on NAK for interrupt and bulk IN EP</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Only acknowledged packets generate an interrupt</description>
                <name>ACKNOW</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Both acknowledged and NAKed packets generate interrupts.</description>
                <name>ACKNOW_NAK</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>INTONNAK_AI</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xE</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt on NAK for control OUT EP</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Only acknowledged packets generate an interrupt</description>
                <name>ACKNOW</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Both acknowledged and NAKed packets generate interrupts.</description>
                <name>ACKNOW_NAK</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>INTONNAK_CO</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xF</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt on NAK for control IN EP</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Only acknowledged packets generate an interrupt</description>
                <name>ACKNOW</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Both acknowledged and NAKed packets generate interrupts.</description>
                <name>ACKNOW_NAK</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>INTONNAK_CI</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x10</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Device status - connect.  The connect bit must be set by SW to indicate that the device must signal a connect. The pull-up resistor on USB_DP will be enabled when this bit is set and the VbusDebounced bit is one.</description>
            <name>DCON</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x11</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Device status - suspend.  The suspend bit indicates the current suspend state. It is set to 1 when the device hasn't seen any activity on its upstream port for more than 3 milliseconds. It is reset to 0 on any activity. When the device is suspended (Suspend bit DSUS = 1) and the software writes a 0 to it, the device will generate a remote wake-up. This will only happen when the device is connected (Connect bit = 1). When the device is not connected or not suspended, a writing a 0 has no effect. Writing a 1 never has an effect.</description>
            <name>DSUS</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x13</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Device status - LPM Suspend.  This bit represents the current LPM suspend state. It is set to 1 by HW when the device has acknowledged the LPM request from the USB host and the Token Retry Time of 10us has elapsed. When the device is in the LPM suspended state (LPM suspend bit = 1) and the software writes a zero to this bit, the device will generate a remote walk-up. Software can only write a zero to this bit when the LPM_REWP bit is set to 1. HW resets this bit when it receives a host initiated resume. HW only updates the LPM_SUS bit when the LPM_SUPP bit is equal to one.</description>
            <name>LPM_SUS</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x14</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>LPM Remote Wake-up Enabled by USB host.  HW sets this bit to one when the bRemoteWake bit in the LPM extended token is set to 1. HW will reset this bit to 0 when it receives the host initiated LPM resume, when a remote wake-up is sent by the device or when a USB bus reset is received. Software can use this bit to check if the remote wake-up feature is enabled by the host for the LPM transaction.</description>
            <name>LPM_REWP</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x18</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Device status - connect change.  The Connect Change bit is set when the device's pull-up resistor is disconnected because VBus disappeared. The bit is reset by writing a one to it.</description>
            <name>DCON_C</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x19</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Device status - suspend change.  The suspend change bit is set to 1 when the suspend bit toggles. The suspend bit can toggle because: - The device goes in the suspended state  - The device is disconnected - The device receives resume signaling on its upstream port.  The bit is reset by writing a one to it.</description>
            <name>DSUS_C</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1A</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Device status - reset change.  This bit is set when the device received a bus reset. On a bus reset the device will automatically go to the default state (unconfigured and responding to address 0). The bit is reset by writing a one to it.</description>
            <name>DRES_C</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1C</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>This bit indicates if Vbus is detected or not. The bit raises immediately when Vbus becomes high. It drops to zero if Vbus is low for at least 3 ms. If this bit is high and the DCon bit is set, the HW will enable the pull-up resistor to signal a connect.</description>
            <name>VBUSDEBOUNCED</name>
          </field>
        </fields>
        <name>DEVCMDSTAT</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x800</resetValue>
        <size>0x20</size>
      </register>
