ItaySharon/cmsis-svd/data/NXP/LPC13Uxx_v1.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x4</addressOffset>
        <description>USB Info register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0xB</bitWidth>
            <description>Frame number. This contains the frame number of the last successfully received SOF. In case no SOF was received by the device at the beginning of a frame, the frame number returned is that of the last successfully received SOF. In case the SOF frame number contained a CRC error, the frame number returned will be the corrupted frame number as received by the device.</description>
            <name>FRAME_NR</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xB</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>The error code which last occurred:</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No error</description>
                <name>NO_ERROR</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>PID encoding error</description>
                <name>PID_ENCODING_ERROR</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>PID unknown</description>
                <name>PID_UNKNOWN</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Packet unexpected</description>
                <name>PACKET_UNEXPECTED</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Token CRC error</description>
                <name>TOKEN_CRC_ERROR</name>
                <value>0x4</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Data CRC error</description>
                <name>DATA_CRC_ERROR</name>
                <value>0x5</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Time out</description>
                <name>TIME_OUT</name>
                <value>0x6</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Babble</description>
                <name>BABBLE</name>
                <value>0x7</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Truncated EOP</description>
                <name>TRUNCATED_EOP</name>
                <value>0x8</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Sent/Received NAK</description>
                <name>SENT_RECEIVED_NAK</name>
                <value>0x9</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Sent Stall</description>
                <name>SENT_STALL</name>
                <value>0xA</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Overrun</description>
                <name>OVERRUN</name>
                <value>0xB</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Sent empty packet</description>
                <name>SENT_EMPTY_PACKET</name>
                <value>0xC</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Bitstuff error</description>
                <name>BITSTUFF_ERROR</name>
                <value>0xD</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Sync error</description>
                <name>SYNC_ERROR</name>
                <value>0xE</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Wrong data toggle</description>
                <name>WRONG_DATA_TOGGLE</name>
                <value>0xF</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>ERR_CODE</name>
          </field>
        </fields>
        <name>INFO</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x8</addressOffset>
        <description>USB EP Command/Status List start address</description>
        <fields>
          <field>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x18</bitWidth>
            <description>Start address of the USB EP Command/Status List.</description>
            <name>EP_LIST</name>
          </field>
        </fields>
        <name>EPLISTSTART</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
