ItaySharon/cmsis-svd/data/NXP/LPC13Uxx_v1.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x11</addressOffset>
        <description>Byte pin registers port 0/1; pins PIO0/1_0 to PIO0/1_31</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin P0/1_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[17]</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x12</addressOffset>
        <description>Byte pin registers port 0/1; pins PIO0/1_0 to PIO0/1_31</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin P0/1_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[18]</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x13</addressOffset>
        <description>Byte pin registers port 0/1; pins PIO0/1_0 to PIO0/1_31</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin P0/1_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[19]</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x14</addressOffset>
        <description>Byte pin registers port 0/1; pins PIO0/1_0 to PIO0/1_31</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin P0/1_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[20]</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x15</addressOffset>
        <description>Byte pin registers port 0/1; pins PIO0/1_0 to PIO0/1_31</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin P0/1_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[21]</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x16</addressOffset>
        <description>Byte pin registers port 0/1; pins PIO0/1_0 to PIO0/1_31</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin P0/1_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[22]</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x17</addressOffset>
        <description>Byte pin registers port 0/1; pins PIO0/1_0 to PIO0/1_31</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin P0/1_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[23]</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x18</addressOffset>
        <description>Byte pin registers port 0/1; pins PIO0/1_0 to PIO0/1_31</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin P0/1_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[24]</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
