ItaySharon/cmsis-svd/data/NXP/LPC13Uxx_v1.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x21</addressOffset>
        <description>Byte pin registers port 0/1; pins PIO0/1_0 to PIO0/1_31</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin P0/1_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[33]</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x22</addressOffset>
        <description>Byte pin registers port 0/1; pins PIO0/1_0 to PIO0/1_31</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin P0/1_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[34]</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x23</addressOffset>
        <description>Byte pin registers port 0/1; pins PIO0/1_0 to PIO0/1_31</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin P0/1_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[35]</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x24</addressOffset>
        <description>Byte pin registers port 0/1; pins PIO0/1_0 to PIO0/1_31</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin P0/1_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[36]</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x25</addressOffset>
        <description>Byte pin registers port 0/1; pins PIO0/1_0 to PIO0/1_31</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin P0/1_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[37]</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x26</addressOffset>
        <description>Byte pin registers port 0/1; pins PIO0/1_0 to PIO0/1_31</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin P0/1_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[38]</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x27</addressOffset>
        <description>Byte pin registers port 0/1; pins PIO0/1_0 to PIO0/1_31</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin P0/1_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[39]</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x28</addressOffset>
        <description>Byte pin registers port 0/1; pins PIO0/1_0 to PIO0/1_31</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin P0/1_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[40]</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
