ItaySharon/cmsis-svd/data/NXP/LPC13Uxx_v1.svd
    </registers>
    <registers>
      <register>
        <access>write-only</access>
        <addressOffset>0x2300</addressOffset>
        <description>Toggle port 0/1</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP0</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP1</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP2</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP3</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP4</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP5</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP6</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP7</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP8</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x9</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP9</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xA</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP10</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xB</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP11</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xC</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP12</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xD</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP13</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xE</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP14</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xF</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP15</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x10</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP16</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x11</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP17</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x12</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP18</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x13</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP19</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x14</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP20</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x15</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP21</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x16</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP22</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x17</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP23</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x18</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP24</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x19</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP25</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1A</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP26</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1B</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP27</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1C</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP28</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1D</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP29</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1E</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP30</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1F</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP31</name>
          </field>
        </fields>
        <name>NOT0</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
      </register>
